# Data Analysis with Pandas - Project 1

Proyecto inspirado en Conocimientos de Pandas
by **Profe: Oscar Yllan** 
**Tel: +52 81-2093-1925**

In [143]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\oscar\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\oscar\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\oscar\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\oscar\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\oscar\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\oscar\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [144]:
# We are importing the library of pandas
# Vamos a importar la libreria de Pandas 
import pandas as pd

In [145]:
# We are creating a pandas Dataframe that is a type of Data Structure of Pandas from a Python dictionary
# Vamos a crear un pandas DataFrame la cual es un tipo de estructura de datos de Pandas apartir de un diccionario de Python
dict1= { 'Name': ['Jaime','Rebeca','Regina','Renata','Omar','Dorothy','Elle'],
    'Marks': [98,99,99,100,90,82,54],
        'Gender': ['Male','Female','Female','Female','Male','Female','Female']
       }
df1=pd.DataFrame(dict1)
# Showing the Dataframe
df1

      Name  Marks  Gender
0    Jaime     98    Male
1   Rebeca     99  Female
2   Regina     99  Female
3   Renata    100  Female
4     Omar     90    Male
5  Dorothy     82  Female
6     Elle     54  Female

## 1. Display Top 3 Rows of the Dataset

In [147]:
# The method .head() gives us the top 5 rows of the Dataset and the argument inside can be the number of Rows to display
# El metodo .head() nos da las 5 filas de arriba Y EL ARGUMENTO PODEMOS PONERLE CUANTAS FILAS
df1.head(3)

     Name  Marks  Gender
0   Jaime     98    Male
1  Rebeca     99  Female
2  Regina     99  Female

## Check Last 4 Rows of the DataSet

In [149]:
# Equivalently the method .tail() is the one that gives us the Bottom 5 rows of the Datframe and the argument can be used to indicate the number of Rows
# De manera equivalente, el método .tail() es el que nos da las últimas 5 filas del DataFrame y se puede usar el argumento para indicar el número de filas

df1.tail(4)

      Name  Marks  Gender
3   Renata    100  Female
4     Omar     90    Male
5  Dorothy     82  Female
6     Elle     54  Female

## 3. Find Shape of our DataSet (Number of Rows & Number of Columns)
## 3. Encontrar la forma de nuestro conjunto de datos (Número de filas y número de columnas)

In [151]:
# The property of .shape gives us the number of rows and columns (the dimensions)
# La propiedad .shape nos da el número de filas y columnas (las dimensiones)
df1.shape

(7, 3)

## 4. Get information About our Dataset Like total Number of Rows, Total Number of columns, Datatypes of each Column and Memory and Requirement
## 4. Obtener información sobre nuestro conjunto de datos, como el número total de filas, número total de columnas, tipos de datos de cada columna y uso de memoria y requisitos

In [153]:
# With the method .info() we can get some of these important values and info
# Con el método .info() podemos obtener algunos de estos valores e información importantes

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

## 5. Check Null Values in the DataSet
## 5. Verificar valores nulos en el conjunto de dato

In [155]:
# Checking for null values in the DataFrame
# Verificando valores nulos en el DataFrame

df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [156]:
# Adding the method .sum() can give us the sum of all values per column
# Agregar el método .sum() nos puede dar la suma de todos los valores por columna

df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

## 6. Get Overall Statistics About the Dataframe
## 6. Obtener estadísticas generales sobre el DataFrame

In [158]:
# With the method describe() we can get statistics from the columns with numerical values
# Con el método describe() podemos obtener estadísticas de las columnas con valores numéricos

df1.describe()

            Marks
count    7.000000
mean    88.857143
std     16.717541
min     54.000000
25%     86.000000
50%     98.000000
75%     99.000000
max    100.000000

In [159]:
# If we want to include also the non-numerical columns, we can add the argument include='all'
# Si queremos incluir también las columnas no numéricas, podemos agregar el argumento include='all'

df1.describe(include='all')

         Name       Marks  Gender
count       7    7.000000       7
unique      7         NaN       2
top     Jaime         NaN  Female
freq        1         NaN       5
mean      NaN   88.857143     NaN
std       NaN   16.717541     NaN
min       NaN   54.000000     NaN
25%       NaN   86.000000     NaN
50%       NaN   98.000000     NaN
75%       NaN   99.000000     NaN
max       NaN  100.000000     NaN

## 7. Find Unique values from the Gender Column
## 7. Encontrar valores únicos en la columna Gender

In [161]:
# Displaying the unique values in the 'Gender' column
# Mostrando los valores únicos en la columna 'Gender'
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 8. Find the Number of Unique Values from the Gender Column
## 8. Encontrar el número de valores únicos en la columna Gender

In [163]:
# Finding the number of unique values in the 'Gender' column using len() and unique()
# Encontrar el número de valores únicos en la columna 'Gender' utilizando len() y unique()
len(df1['Gender'].unique())

2

In [164]:
# Finding the number of unique values in the 'Gender' column using nunique()
# Encontrar el número de valores únicos en la columna 'Gender' utilizando nunique()
df1['Gender'].nunique()

2

## 9. Display Count of Unique Values in Gender Column
## 9. Mostrar el conteo de valores únicos en la columna Gender

In [166]:
# Displaying the count of unique values in the 'Gender' column using value_counts()
# Mostrando el conteo de valores únicos en la columna 'Gender' utilizando value_counts()
df1['Gender'].value_counts()

Gender
Female    5
Male      2
Name: count, dtype: int64

## 10. Find Total Number of Students Having Marks Between 90 to 100 (Inclusive) Using Between Method
## 10. Encontrar el número total de estudiantes con calificaciones entre 90 y 100 (inclusive) utilizando el método Between

In [168]:
# Here we are using the between method in order to get the number of values in that range
# Aquí estamos utilizando el método between para obtener el número de valores en ese rango

df1['Marks'].between(90,100).sum()

5

In [169]:
# We can also use Boolean Masking and apply the len() function
# También podemos usar enmascaramiento booleano y aplicar la función len()
len(df1[(df1['Marks']>=90)&(df1['Marks']<=100)])

5

## 11. Find Average Marks
## 11. Encontrar el promedio de las calificaciones

In [171]:
# Calculating the average (mean) of the 'Marks' column
# Calculando el promedio (media) de la columna 'Marks'
df1['Marks'].mean()

88.85714285714286

## 12. Apply Method

## 12. Metodo Aplicar

In [173]:
def marks(x):
    return x/4

In [174]:
# Applying the 'marks' function to each value in the 'Marks' column using the apply() method
# Aplicando la función 'marks' a cada valor en la columna 'Marks' utilizando el método apply()
df1['Marks'].apply(marks)

0    24.50
1    24.75
2    24.75
3    25.00
4    22.50
5    20.50
6    13.50
Name: Marks, dtype: float64

In [175]:
df1['FourthPartofMark']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  FourthPartofMark
0    Jaime     98    Male             24.50
1   Rebeca     99  Female             24.75
2   Regina     99  Female             24.75
3   Renata    100  Female             25.00
4     Omar     90    Male             22.50
5  Dorothy     82  Female             20.50
6     Elle     54  Female             13.50

## 13. Map Function

## 13. Función Map

In [177]:
# Mapping the 'Gender' column to numerical values: 'Male' to 1 and 'Female' to 0
# Mapeando la columna 'Gender' a valores numéricos: 'Male' a 1 y 'Female' a 0
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    0
4    1
5    0
6    0
Name: Gender, dtype: int64

## 14. Drop the Column(s)

## 14. Eliminar columna(s)

In [179]:
# We are going to eliminate the columns that we want
# Vamos a eliminar las columnas que queramos
df1.drop(['Gender', 'FourthPartofMark'],axis=1)

      Name  Marks
0    Jaime     98
1   Rebeca     99
2   Regina     99
3   Renata    100
4     Omar     90
5  Dorothy     82
6     Elle     54

## 15. Print Name of the Columns
## 15. Imprimir el nombre de las columnas

In [181]:
# Displaying the names of the columns in the DataFrame
# Mostrando los nombres de las columnas en el DataFrame
df1.columns

Index(['Name', 'Marks', 'Gender', 'FourthPartofMark'], dtype='object')

## 16. Display Name & Marks of the Female Students
## 16. Mostrar el nombre y las calificaciones de las estudiantes femeninas

In [183]:
# Filtering the DataFrame to display the 'Name' and 'Marks' of female students
# Filtrando el DataFrame para mostrar el 'Nombre' y las 'Calificaciones' de las estudiantes femeninas
df1[(df1['Gender']=='Female')][['Name','Marks']]

      Name  Marks
1   Rebeca     99
2   Regina     99
3   Renata    100
5  Dorothy     82
6     Elle     54

## 17. Sort the DataFrame as per the Marks Column
## 17. Ordenar el DataFrame según la columna de calificaciones (Marks)

In [185]:
# Sorting the DataFrame by the 'Marks' column in ascending order
# Ordenando el DataFrame por la columna 'Marks' en orden ascendente
df1.sort_values(by='Marks')

      Name  Marks  Gender  FourthPartofMark
6     Elle     54  Female             13.50
5  Dorothy     82  Female             20.50
4     Omar     90    Male             22.50
0    Jaime     98    Male             24.50
1   Rebeca     99  Female             24.75
2   Regina     99  Female             24.75
3   Renata    100  Female             25.00

In [186]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender  FourthPartofMark
3   Renata    100  Female             25.00
1   Rebeca     99  Female             24.75
2   Regina     99  Female             24.75
0    Jaime     98    Male             24.50
4     Omar     90    Male             22.50
5  Dorothy     82  Female             20.50
6     Elle     54  Female             13.50